In [12]:
import pandas as pd

# Sample DataFrame
data = {
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Math': [85, 78, 92],
    'Science': [90, 82, 89],
    'English': [88, 85, 94]
}

df = pd.DataFrame(data)

# Display the DataFrame
print(df)

      Name  Math  Science  English
0    Alice    85       90       88
1      Bob    78       82       85
2  Charlie    92       89       94

In [13]:
df.melt(id_vars=["Name"], value_vars=["Math", "Science", "English"], var_name="Subject", value_name="Score")

      Name  Subject  Score
0    Alice     Math     85
1      Bob     Math     78
2  Charlie     Math     92
3    Alice  Science     90
4      Bob  Science     82
5  Charlie  Science     89
6    Alice  English     88
7      Bob  English     85
8  Charlie  English     94

In [16]:
data = {
    'Name': ['Alice', 'Alice', 'Alice',
             'Bob', 'Bob', 'Bob',
             'Charlie', 'Charlie', 'Charlie'],
    'Subject': ['Math', 'Science', 'English',
                'Math', 'Science', 'English',
                'Math', 'Science', 'English'],
    'Score': [85, 90, 88,
              78, 82, 85,
              92, 89, 94]
}
df = pd.DataFrame(data)


df.pivot(index="Name", columns="Subject", values="Score")
#will throw error when have duplicate values..

Subject  English  Math  Science
Name
Alice         88    85       90
Bob           85    78       82
Charlie       94    92       89

In [17]:
data = {
    'Name': ['Alice', 'Alice', 'Alice', 'Bob', 'Bob'],
    'Subject': ['Math', 'Math', 'Science', 'Math', 'Math'],
    'Score': [85, 80, 90, 78, 82]
}
df = pd.DataFrame(data)

df.pivot_table(index="Name", columns="Subject", values="Score", aggfunc="mean")
#We can use pivot_table() to aggregate values (e.g., taking the 
#mean for duplicate entries):

Subject  Math  Science
Name
Alice    82.5     90.0
Bob      80.0      NaN

In [ ]:
#Use melt() to go long, pivot() to go wide
#pivot() is used to turn long-format data into wide-format by spreading unique column values into separate columns.
#If there are duplicate values for a given combination of index and columns, you should use pivot_table() 
#with an aggregation function to handle the duplicates.